{
  "backend/main.mo": "Motoko actor that manages notifications with add, get, list (sorted by date), and delete operations, storing them in a Map with auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report confirming the FSSAI spelling correction was applied in HeroSection.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key changes, serving as a build/change reference for the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the Anand Design React app.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with a shared Layout (Header, Footer, WhatsApp button) and two routes: home (all sections) and /admin (AdminPanel).",
  "frontend/src/components/AdminLogin.tsx": "Password-gated login form for the admin panel with visibility toggle, error feedback, and sessionStorage-based authentication using the hardcoded password 'design2026'.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying a pulsing phone call card and a business info card with address, hours, and service details.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, a services quick-list grid, contact details, working hours, copyright, and an Admin link to /admin.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, working hours badge, smooth-scroll nav links, a call CTA button, and a responsive mobile hamburger menu.",
  "frontend/src/components/HeroSection.tsx": "Full-bleed hero section with a background image, headline, tagline, a phone call CTA, and a 'View Services' scroll button.",
  "frontend/src/components/LatestNotifications.tsx": "Fetches notifications from the backend and displays them as categorized cards with a marquee banner for the latest entry, including loading skeletons.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of 13 service cards (Passport, PAN Card, FSSAI, etc.) each with an icon, name, and subtitle.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp button linking to the business's WhatsApp number.",
  "frontend/src/components/WhyChooseUs.tsx": "Dark navy section displaying four value-proposition feature cards (Fast Processing, Expert Assistance, Trusted by Many, Hassle-Free).",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, adding, and deleting notifications by interacting with the backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Poppins/Inter fonts, configuring Tailwind base/components/utilities, and defining CSS custom properties for an orange-and-navy theme with light/dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page component that allows authenticated admins to view, add, and delete notifications, with category badges, date formatting, and a login gate.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom oklch-based color palettes (navy, orange), CSS variable mappings, and typography/animation plugins.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a fix request to correct the spelling of 'FSSAI' in the top header/hero area."
}